<h1>Содержание<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"><li><span><a href="#Обзор-данных" data-toc-modified-id="Обзор-данных-1"><span class="toc-item-num">1&nbsp;&nbsp;</span>Обзор данных</a></span></li><li><span><a href="#Предобработка-данных" data-toc-modified-id="Предобработка-данных-2"><span class="toc-item-num">2&nbsp;&nbsp;</span>Предобработка данных</a></span><ul class="toc-item"><li><span><a href="#Заполнение-пропусков" data-toc-modified-id="Заполнение-пропусков-2.1"><span class="toc-item-num">2.1&nbsp;&nbsp;</span>Заполнение пропусков</a></span></li><li><span><a href="#Проверка-данных-на-аномалии-и-исправления" data-toc-modified-id="Проверка-данных-на-аномалии-и-исправления-2.2"><span class="toc-item-num">2.2&nbsp;&nbsp;</span>Проверка данных на аномалии и исправления</a></span></li><li><span><a href="#Изменение-типов-данных" data-toc-modified-id="Изменение-типов-данных-2.3"><span class="toc-item-num">2.3&nbsp;&nbsp;</span>Изменение типов данных</a></span></li><li><span><a href="#Удаление-дубликатов" data-toc-modified-id="Удаление-дубликатов-2.4"><span class="toc-item-num">2.4&nbsp;&nbsp;</span>Удаление дубликатов</a></span></li><li><span><a href="#Формирование-дополнительных-датафреймов-словарей,-декомпозиция-исходного-датафрейма" data-toc-modified-id="Формирование-дополнительных-датафреймов-словарей,-декомпозиция-исходного-датафрейма-2.5"><span class="toc-item-num">2.5&nbsp;&nbsp;</span>Формирование дополнительных датафреймов словарей, декомпозиция исходного датафрейма</a></span></li><li><span><a href="#Категоризация-дохода" data-toc-modified-id="Категоризация-дохода-2.6"><span class="toc-item-num">2.6&nbsp;&nbsp;</span>Категоризация дохода</a></span></li><li><span><a href="#Категоризация-целей-кредита" data-toc-modified-id="Категоризация-целей-кредита-2.7"><span class="toc-item-num">2.7&nbsp;&nbsp;</span>Категоризация целей кредита</a></span></li></ul></li><li><span><a href="#Ответы-на-вопросы-исследования" data-toc-modified-id="Ответы-на-вопросы-исследования-3"><span class="toc-item-num">3&nbsp;&nbsp;</span>Ответы на вопросы исследования</a></span><ul class="toc-item"><li><span><a href="#Выяснение-зависимости-между-количеством-детей-клиента-и-возвратом-им-кредита-в-срок" data-toc-modified-id="Выяснение-зависимости-между-количеством-детей-клиента-и-возвратом-им-кредита-в-срок-3.1"><span class="toc-item-num">3.1&nbsp;&nbsp;</span>Выяснение зависимости между количеством детей клиента и возвратом им кредита в срок</a></span></li><li><span><a href="#Выяснение-зависимости-возврата-кредита-в-срок-от-семейного-положения-клиента" data-toc-modified-id="Выяснение-зависимости-возврата-кредита-в-срок-от-семейного-положения-клиента-3.2"><span class="toc-item-num">3.2&nbsp;&nbsp;</span>Выяснение зависимости возврата кредита в срок от семейного положения клиента</a></span></li><li><span><a href="#Выяснение-зависимости-уровня-дохода-клиента-и-возврата-кредита-в-срок" data-toc-modified-id="Выяснение-зависимости-уровня-дохода-клиента-и-возврата-кредита-в-срок-3.3"><span class="toc-item-num">3.3&nbsp;&nbsp;</span>Выяснение зависимости уровня дохода клиента и возврата кредита в срок</a></span></li><li><span><a href="#Влияние-цели-кредита-на-его-своевременное-погашение" data-toc-modified-id="Влияние-цели-кредита-на-его-своевременное-погашение-3.4"><span class="toc-item-num">3.4&nbsp;&nbsp;</span>Влияние цели кредита на его своевременное погашение</a></span></li></ul></li><li><span><a href="#Общий-вывод" data-toc-modified-id="Общий-вывод-4"><span class="toc-item-num">4&nbsp;&nbsp;</span>Общий вывод</a></span></li></ul></div>

# Исследование надёжности заемщиков

Заказчик исследования — кредитный отдел банка.
Нужно разобраться, какие из выбранных характеристик клиента влияют на факт погашения кредита в срок.
Входные данные от банка — статистика о платёжеспособности клиентов.

**Цель исследования** — ответить на четыре вопроса:
1. Есть ли зависимость между количеством детей и возвратом кредита в срок?
2. Есть ли зависимость между семейным положением и возвратом кредита в срок? 
3. Есть ли зависимость между уровнем дохода и возвратом кредита в срок?
4. Как разные цели кредита влияют на его возврат в срок?

**Ход исследования**

О качестве полученных данных ничего не известно. Поэтому перед ответами на вопросы понадобится обзор данных. 

Проверим данные на пропущенные значения и артефакты. Затем исправим их на этапе предобработки. После чего ответим на поставленные вопросы исследования.
 
Таким образом, исследование пройдёт в три этапа:
 1. Обзор данных.
 2. Предобработка данных.
 3. Ответы на вопросы.

## Обзор данных

In [1]:
# чтение csv-файла и создание датафрейма
import pandas as pd

df = pd.read_csv('data_borrowers.csv')

In [2]:
# получение случайных 15 строк таблицы df
df.sample(15, random_state=1)

,children,days_employed,dob_years,education,education_id,family_status,family_status_id,gender,income_type,debt,total_income,purpose
1383,0,353802.811675,37,среднее,1,вдовец / вдова,2,F,пенсионер,0,216452.226085,строительство недвижимости
300,1,-359.193975,33,СРЕДНЕЕ,1,гражданский брак,1,M,сотрудник,0,223001.623994,на проведение свадьбы
6565,2,-1064.854333,35,среднее,1,гражданский брак,1,F,компаньон,0,163591.209323,свадьба
17027,0,NaN,48,высшее,0,гражданский брак,1,F,сотрудник,0,NaN,операции с жильем
4077,0,-7059.100220,45,высшее,0,гражданский брак,1,F,компаньон,1,194820.185757,сыграть свадьбу
10437,0,-2258.301455,50,среднее,1,женат / замужем,0,F,сотрудник,0,146768.250599,операции с коммерческой недвижимостью
9631,1,-1045.752744,23,среднее,1,женат / замужем,0,M,сотрудник,0,81734.568425,операции с коммерческой недвижимостью
19867,0,NaN,39,среднее,1,женат / замужем,0,M,сотрудник,0,NaN,дополнительное образование
9124,0,-282.186487,48,среднее,1,в разводе,3,F,компаньон,0,284275.683334,строительство жилой недвижимости
19634,0,-1320.103813,46,среднее,1,женат / замужем,0,F,компаньон,0,184569.030590,автомобили
20389,0,NaN,58,среднее,1,женат / замужем,0,F,пенсионер,0,NaN,ремонт жилью
12257,2,NaN,38,высшее,0,женат / замужем,0,M,компаньон,0,NaN,заняться образованием
17051,1,NaN,30,высшее,0,Не женат / не замужем,4,F,сотрудник,0,NaN,ремонт жилью
3069,0,367871.226307,66,среднее,1,женат / замужем,0,M,пенсионер,0,63599.469061,на покупку подержанного автомобиля
8325,0,-535.611219,29,высшее,0,женат / замужем,0,M,сотрудник,1,238157.115151,автомобиль

In [3]:
# получение общей информации о данных в таблице df
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 21525 entries, 0 to 21524
Data columns (total 12 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   children          21525 non-null  int64
 1   days_employed     19351 non-null  float64
 2   dob_years         21525 non-null  int64
 3   education         21525 non-null  object
 4   education_id      21525 non-null  int64
 5   family_status     21525 non-null  object
 6   family_status_id  21525 non-null  int64
 7   gender            21525 non-null  object
 8   income_type       21525 non-null  object
 9   debt              21525 non-null  int64
 10  total_income      19351 non-null  float64
 11  purpose           21525 non-null  object
dtypes: float64(2), int64(5), object(5)
memory usage: 2.0+ MB

In [4]:
# получение данных о характерных значениях для столбцов df
df.describe().style.format('{:.2f}')

**Промежуточные выводы**

Предварительно взглянув на данные, можно заметить некоторые явные проблемы и артефакты, например:
1. В двух столбцах, `days_employed` и `total_income`, присутствуют пропущенные значения.
2. Для вышеуказанных же столбцов выбран не совсем подходящий тип данных — `float64` вместо `int64` — отображение значений не соответствует характеру данных.
3. Встречаются нелогичные отрицательные значения трудового стажа клиента, остальные же слишком велики для единицы измерения в днях.
4. Можно заметить нереалистичные нулевые значения возраста клиентов.

## Предобработка данных

### Заполнение пропусков

На этапе обзора данных было замечено, что пропущены данные об общем трудовом стаже и ежемесячном доходе клиента. Проверим ещё раз.

In [5]:
# получение количества пропущенных значений в столбцах df
df.isna().sum()

children               0
days_employed       2174
dob_years              0
education              0
education_id           0
family_status          0
family_status_id       0
gender                 0
income_type            0
debt                   0
total_income        2174
purpose                0
dtype: int64

Оценим их долю от общего количества значений.

In [6]:
# вывод доли пропущенных значений
missed_part_of_days_employed = df['days_employed'].isna().mean()
missed_part_of_total_income = df['total_income'].isna().mean()
print(f'Доля пропущенных значений об общем трудовом стаже {missed_part_of_days_employed:.0%}')
print(f'Доля пропущенных значений о ежемесячном доходе {missed_part_of_total_income:.0%}')

Доля пропущенных значений об общем трудовом стаже 10%
Доля пропущенных значений о ежемесячном доходе 10%

При обзоре данных можно было заметить, что значения обоих столбцов отсутствуют только единовременно для одной строки. Убедимся, что данное условие выполняется всегда. Проверим, для всех ли строк значения в вышеуказанных столбцах пропущены одновременно.

In [7]:
# проверка одинакового в плане пропусков состояния всех строк df 
(df['days_employed'].isna() == df['total_income'].isna()).all()

True

Для всех строк датафрейма значения в рассматриваемых столбцах либо одновременно пропущены, либо нет, что подтверждает, что предположение верно.

Далее заполним пропуски в столбце без каких-либо ещё артефактов данных — `total_income`. Новым будет значение, характерное для ежемесячного дохода клиента; выберем медианное, так как разброс зарплат может быть очень большим. Из-за этого при выборе, например, среднего значения оно может оказаться недостаточно репрезентативным, так как возможен сильный перекос в сторону сильно отличающегося значения. Для большей точности заменим значения для каждого типа занятости клиента по отдельности. Также перед заменой проверим, не зависит ли появление пропуска в строке от её значения в другом столбце. Если выяснится, что доля пропусков в какой-то конкретной группе клиентов по одному из признаков (или нескольким) сильно отличается от показателя в других группах этого же признака, заменять их медианным значением будет некорректно.

In [8]:
# получение доли пропусков total_income по значениям других столбцов df без пропусков
for column in df.columns:
    if column != 'total_income' and column != 'days_employed':
        display(df.groupby(column)['total_income'].apply(lambda x : x.isna().mean()).to_frame().style.format('{:.0%}'))

Если отбросить небольшие группы, то видно, что доли пропусков в каждой из них за исключением двух, клиентов с неоконченным высшим образованием и предпренимателей, примерно одинаковые, следовательно, для большинства групп можно заменять пропуски медианным значением.

Для двух же указанных выше групп доля пропущенных значений довольно сильно отличается — 40-50%. Вероятно, данные типы клиентов довольно часто могли не указывать рассматриваемые параметры по причине возможного малого трудового стажа и низкого дохода при их роде деятельности. Но за неимением дополнительной информации найти какое-то отличное от медианного характерное значение для замены пропусков, являющееся более достоверным, не представляется возможным. Заменим также медианным для соответствующего типа занятости.

In [9]:
# замена пропущенных значений в столбце медианным c учётом типа занятости
for definition in df['income_type'].unique():
    df.loc[df['income_type'].isin([definition]),
           'total_income'] = df.loc[df['income_type'].isin([definition]),
           'total_income'].fillna(df.loc[df['income_type'].isin([definition]),
           'total_income'].median())
                           
# проверка отсутствия пропущенных значений ежемесячного дохода
df['total_income'].isna().sum()

0

**Промежуточные выводы**

Обработав пропуски в столбцах, можно прийти к определённым выводам:
1. Доля пропущенных значений — 10% — была достаточно велика, в связи с чем в одном из столбцов они были заменены на медианное значение количественного параметра, позволяющее не сильно исказить общую достоверность данных, а также не упустить необходимые для дальнейшего исследования значения.
2. Учитывая, что количество пропущенных значений в каждом случае совпадает и пропуски в обоих столбцах появляются только одновременно, можно сделать предположение, что данные пропуски неслучайны. Причиной их появления могло быть, например, намеренное непредоставление соответствующих данных клиентами с низким доходом и небольшим трудовым стажем из-за их опасения в отказе выдачи кредита на основании полученной информации. Также это могут быть люди, ни разу в своей жизни не работающиее по найму и не получающие лично какого-либо дохода, что тоже возможно.

### Проверка данных на аномалии и исправления

Приступим к обработке артефактов в данных перед избавлением от пропущенных значений в столбце `days_employed`.
Отрицательные значения и сотни тысяч дней трудового стажа не могут соответствовать действительности. В иделе можно было бы обратиться к тому, от кого получены данные за разъяснениями, но за неимением такой возможности произведём изменения соответствующих значений.

В отрицательных значениях, вероятно, ошибочно стоит знак "минус", так как модули значений выглядят вполне соответствующими реальности.
Переведём все значения трудового стажа в положительные.

In [10]:
# замена значений в столбце их модулями
df['days_employed'] = abs(df['days_employed'])

# проверка отсутствия отрицательных значений столбца days_employed
df[df['days_employed'] < 0]['dob_years'].count()

0

При обзоре данных можно было заметить, что слишком большие значения трудового стажа встречаются в основном у пенсионеров. Для проверки предположения найдём средний показатель стажа для разных типов занятости клиентов.

In [11]:
# вывод на экран среднего значения для всех типов занятости
df.groupby('income_type')['days_employed'].median().to_frame().style.format('{:.0f}')

Нереалистично высокие показатели встречаются у двух типов клиентов: пенсионеров и безработных. Очевидные причины появления артефактов с такими значениями без дополнительной информации назвать нельзя. Можно предположить, что значения для данных категорий хранятся в другой еденице измерения, отличной от дней. По величине значений самой логичной выглядят часы.
Разделим значения в соответствующих колонках на 24 и выведем их новые средние показатели.

In [12]:
# изменение значений в столбце income_type по нужному условию
df.loc[df['income_type'].isin(['пенсионер','безработный']),'days_employed'] = df['days_employed'] / 24

# вывод на экран обновленного среднего значения для всех типов занятости
df.groupby('income_type')['days_employed'].median().to_frame().style.format('{:.0f}')

Теперь значения выглядят более соответствующими действительности. Можем приступить к заполнению пропусков в столбце с трудовым стажем клентов.

In [13]:
# замена пропущенных значений в столбце медианным c учётом типа занятости
for definition in df['income_type'].unique():
    df.loc[df['income_type'].isin([definition]),
           'days_employed'] = df.loc[df['income_type'].isin([definition]),
           'days_employed'].fillna(df.loc[df['income_type'].isin([definition]),
           'days_employed'].median())

# проверка отсутствия пропущенных значений во всём датасете
df.isna().sum()

children            0
days_employed       0
dob_years           0
education           0
education_id        0
family_status       0
family_status_id    0
gender              0
income_type         0
debt                0
total_income        0
purpose             0
dtype: int64

Осталась ещё одна проблема в данных — значения возраста, равные 0. Взглянем на распределение значений остальных столбцов для строк с данным артефактом ряди поиска возможной очевидной зависимости появления нулевого значения.

In [14]:
# получение распределения значений среза df с нулевым возрастом клиентов
df[df['dob_years']==0].describe().style.format('{:.2f}')

In [15]:
# получение значений столбцов среза df с нулевым возрастом клиентов
for column in df.columns:
    display(df[df['dob_years']==0][column].value_counts().to_frame())
    print()

    children
0         69
1         16
2         13
3          2
20         1

              days_employed
1574.202821               5
15217.221094              3
1547.382223               2
4774.343347               1
1875.972013               1
...                     ...
908.172637                1
1371.207222               1
1478.092467               1
2502.891798               1
2497.754414               1

[94 rows x 1 columns]

   dob_years
0        101

                     education
среднее                     59
высшее                      32
Среднее                      3
Высшее                       2
неоконченное высшее          2
СРЕДНЕЕ                      2
ВЫСШЕЕ                       1

   education_id
1            64
0            35
2             2

                       family_status
женат / замужем                   49
гражданский брак                  21
Не женат / не замужем             16
в разводе                         10
вдовец / вдова                     5

   family_status_id
0                49
1                21
4                16
3                10
2                 5

   gender
F      72
M      29

             income_type
сотрудник             55
компаньон             20
пенсионер             20
госслужащий            6

   debt
0    93
1     8

               total_income
142594.396847             5
118514.486412             3
172357.950966             2
263121.074528             1
71291.522491              1
...                     ...
386373.636958             1
287328.538328             1
181510.868867             1
313949.845188             1
287173.027278             1

[94 rows x 1 columns]

                                        purpose
операции с жильем                             6
жилье                                         6
покупка жилья                                 6
свадьба                                       5
сыграть свадьбу                               5
на покупку автомобиля                         5
автомобиль                                    4
недвижимость                                  4
на проведение свадьбы                         4
строительство жилой недвижимости              3
покупка недвижимости                          3
покупка коммерческой недвижимости             3
заняться высшим образованием                  3
покупка жилой недвижимости                    3
свой автомобиль                               3
образование                                   3
на покупку своего автомобиля                  3
операции с недвижимостью                      3
высшее образование                            3
сделка с подержанным автомобилем              2
дополнительное образование                    2
получение дополнительного образования         2
получение высшего образования                 2
приобретение автомобиля                       2
строительство собственной недвижимости        2
автомобили                                    2
покупка жилья для сдачи                       2
ремонт жилью                                  2
операции с коммерческой недвижимостью         2
профильное образование                        1
получение образования                         1
покупка жилья для семьи                       1
покупка своего жилья                          1
сделка с автомобилем                          1
заняться образованием                         1

Обнаружить какие-либо явные закономерности не удалось.

**Промежуточные итоги**

Так как в данных были обнаружены артефакты разного характера, они были обработаны для заполнения оставшихся пропусков датасета более релевантными значениями.
Найти точную причину появления подобных аномалий за неимением возможности обратиться к источнику информации не возможно. Остаётся предположить, что могла произойти техническая ошибка выгрузки или просчета значений.

Также нет возможности выяснить природу очевидно ошибочных нулевых значений возраста клиентов. Но учитывая небольшое количество подобных случаев (около 0,5%) и то, что значение возраста клиента в целом не понадобится в дальнейшем исследовании, данный артефакт можно проигнорировать.

### Изменение типов данных

На этапе обзора данных можно было заметить ещё одну проблему. Для тех же столбцов, где были обнаружены пропущенные значения, изначально выбран не столь подходящий характеру значений тип данных — `float64`. Изменим его на более соответствующий ситуации `int64`.

In [16]:
# изменение типа данных в нужных столбцах
df[['days_employed', 'total_income']] = df[['days_employed', 'total_income']].astype('int')

# проверка изменений 
df.dtypes

children             int64
days_employed        int32
dob_years            int64
education           object
education_id         int64
family_status       object
family_status_id     int64
gender              object
income_type         object
debt                 int64
total_income         int32
purpose             object
dtype: object

Взглянем на часть данных для визуальной оценки всех внесённых изменений.

In [17]:
# получение случайных 15 строк таблицы df
df.sample(15, random_state=1)

,children,days_employed,dob_years,education,education_id,family_status,family_status_id,gender,income_type,debt,total_income,purpose
1383,0,14741,37,среднее,1,вдовец / вдова,2,F,пенсионер,0,216452,строительство недвижимости
300,1,359,33,СРЕДНЕЕ,1,гражданский брак,1,M,сотрудник,0,223001,на проведение свадьбы
6565,2,1064,35,среднее,1,гражданский брак,1,F,компаньон,0,163591,свадьба
17027,0,1574,48,высшее,0,гражданский брак,1,F,сотрудник,0,142594,операции с жильем
4077,0,7059,45,высшее,0,гражданский брак,1,F,компаньон,1,194820,сыграть свадьбу
10437,0,2258,50,среднее,1,женат / замужем,0,F,сотрудник,0,146768,операции с коммерческой недвижимостью
9631,1,1045,23,среднее,1,женат / замужем,0,M,сотрудник,0,81734,операции с коммерческой недвижимостью
19867,0,1574,39,среднее,1,женат / замужем,0,M,сотрудник,0,142594,дополнительное образование
9124,0,282,48,среднее,1,в разводе,3,F,компаньон,0,284275,строительство жилой недвижимости
19634,0,1320,46,среднее,1,женат / замужем,0,F,компаньон,0,184569,автомобили
20389,0,15217,58,среднее,1,женат / замужем,0,F,пенсионер,0,118514,ремонт жилью
12257,2,1547,38,высшее,0,женат / замужем,0,M,компаньон,0,172357,заняться образованием
17051,1,1574,30,высшее,0,Не женат / не замужем,4,F,сотрудник,0,142594,ремонт жилью
3069,0,15327,66,среднее,1,женат / замужем,0,M,пенсионер,0,63599,на покупку подержанного автомобиля
8325,0,535,29,высшее,0,женат / замужем,0,M,сотрудник,1,238157,автомобиль

**Промежуточные итоги**

Было произведено измение типа данных на более соответствующий характеру представленных значений.

### Удаление дубликатов

Одной из распространенных проблем с данными также является наличие дубликатов. При выводе случайных строк таблицы можно было заметить как минимум неявные дубликаты в столбце `education`, одинаковые значения, но записанные с использованием либо заглавных, либо строчных букв.

Для нахождения как можно большего количества строк с дубликатами изначально избавимся от этих и других возможных идентичных значений, записанных в разном регистре.

In [18]:
# Изменение регистра в нужных столбцах
df[['education',
    'family_status',
    'income_type',
    'gender',
    'purpose']] = df[['education',
    'family_status',
    'income_type',
    'gender',
    'purpose']].apply(lambda x:x.str.lower(), axis=1)
    
# оценивание внесённых изменений
df.sample(15, random_state=1)

,children,days_employed,dob_years,education,education_id,family_status,family_status_id,gender,income_type,debt,total_income,purpose
1383,0,14741,37,среднее,1,вдовец / вдова,2,f,пенсионер,0,216452,строительство недвижимости
300,1,359,33,среднее,1,гражданский брак,1,m,сотрудник,0,223001,на проведение свадьбы
6565,2,1064,35,среднее,1,гражданский брак,1,f,компаньон,0,163591,свадьба
17027,0,1574,48,высшее,0,гражданский брак,1,f,сотрудник,0,142594,операции с жильем
4077,0,7059,45,высшее,0,гражданский брак,1,f,компаньон,1,194820,сыграть свадьбу
10437,0,2258,50,среднее,1,женат / замужем,0,f,сотрудник,0,146768,операции с коммерческой недвижимостью
9631,1,1045,23,среднее,1,женат / замужем,0,m,сотрудник,0,81734,операции с коммерческой недвижимостью
19867,0,1574,39,среднее,1,женат / замужем,0,m,сотрудник,0,142594,дополнительное образование
9124,0,282,48,среднее,1,в разводе,3,f,компаньон,0,284275,строительство жилой недвижимости
19634,0,1320,46,среднее,1,женат / замужем,0,f,компаньон,0,184569,автомобили
20389,0,15217,58,среднее,1,женат / замужем,0,f,пенсионер,0,118514,ремонт жилью
12257,2,1547,38,высшее,0,женат / замужем,0,m,компаньон,0,172357,заняться образованием
17051,1,1574,30,высшее,0,не женат / не замужем,4,f,сотрудник,0,142594,ремонт жилью
3069,0,15327,66,среднее,1,женат / замужем,0,m,пенсионер,0,63599,на покупку подержанного автомобиля
8325,0,535,29,высшее,0,женат / замужем,0,m,сотрудник,1,238157,автомобиль

Далее проверим, присутствуют ли в данных явные строки-дубликаты и при наличии удалим их.

In [19]:
# получение количества явных дубликатов
df.duplicated().sum()

71

In [20]:
# удаление явных дубликатов
df = df.drop_duplicates().reset_index(drop=True)

Поищем неявные дубликаты для столбцов с типом данных `object`.

In [21]:
# вывод уникальных значений столбца
df['education'].value_counts()

среднее                15172
высшее                  5250
неоконченное высшее      744
начальное                282
ученая степень             6
Name: education, dtype: int64

In [22]:
# вывод уникальных значений столбца
df['family_status'].value_counts()

женат / замужем          12339
гражданский брак          4151
не женат / не замужем     2810
в разводе                 1195
вдовец / вдова             959
Name: family_status, dtype: int64

In [23]:
# вывод уникальных значений столбца
df['gender'].value_counts()

f      14174
m       7279
xna        1
Name: gender, dtype: int64

In [24]:
# вывод уникальных значений столбца
df['income_type'].value_counts()

сотрудник          11084
компаньон           5078
пенсионер           3829
госслужащий         1457
предприниматель        2
безработный            2
в декрете              1
студент                1
Name: income_type, dtype: int64

In [25]:
# вывод уникальных значений столбца
df['purpose'].value_counts()

свадьба                                   791
на проведение свадьбы                     768
сыграть свадьбу                           765
операции с недвижимостью                  675
покупка коммерческой недвижимости         661
операции с жильем                         652
покупка жилья для сдачи                   651
операции с коммерческой недвижимостью     650
покупка жилья                             646
жилье                                     646
покупка жилья для семьи                   638
строительство собственной недвижимости    635
недвижимость                              633
операции со своей недвижимостью           627
строительство жилой недвижимости          624
покупка недвижимости                      621
покупка своего жилья                      620
строительство недвижимости                619
ремонт жилью                              607
покупка жилой недвижимости                606
на покупку своего автомобиля              505
заняться высшим образованием              496
автомобиль                                494
сделка с подержанным автомобилем          486
свой автомобиль                           478
автомобили                                478
на покупку подержанного автомобиля        478
на покупку автомобиля                     471
приобретение автомобиля                   461
дополнительное образование                460
сделка с автомобилем                      455
высшее образование                        452
образование                               447
получение дополнительного образования     446
получение образования                     442
профильное образование                    436
получение высшего образования             426
заняться образованием                     408
Name: purpose, dtype: int64

В итоге неявные дубликаты были обнаржуены только в столбце с информацией о цели получения кредита. Обработаем их, заменив разные значения одним обобщающим, где это будет корректно по смыслу, то есть не нарушится детализация цели, так как последнее может понадобиться при какой-либо иной работе с представленными данными.

In [26]:
# последовательный вызов метода replace() для изменения соответствующих значений

df['purpose'] = df['purpose'].replace(['свадьба', 'на проведение свадьбы', 'сыграть свадьбу'], 'проведение свадьбы')

df['purpose'] = df['purpose'].replace(['автомобиль', 'сделка с автомобилем'], 'операции с автомобилем')

df['purpose'] = df['purpose'].replace(['образование', 'заняться образованием'], 'получение образования')

df['purpose'] = df['purpose'].replace(['заняться высшим образованием', 'высшее образование'], 'получение высшего образования')

df['purpose'] = df['purpose'].replace('покупка жилья', 'покупка жилой недвижимости')

df['purpose'] = df['purpose'].replace('недвижимость', 'операции с недвижимостью')

df['purpose'] = df['purpose'].replace('жилье', 'операции с жильем')

df['purpose'] = df['purpose'].replace('на покупку автомобиля', 'приобретение автомобиля')

df['purpose'] = df['purpose'].replace('дополнительное образование', 'получение дополнительного образования')

Посмотрим на изменения.

In [27]:
# вывод уникальных значений столбца purpose
df['purpose'].value_counts()

проведение свадьбы                        2324
получение высшего образования             1374
операции с недвижимостью                  1308
операции с жильем                         1298
получение образования                     1297
покупка жилой недвижимости                1252
операции с автомобилем                     949
приобретение автомобиля                    932
получение дополнительного образования      906
покупка коммерческой недвижимости          661
покупка жилья для сдачи                    651
операции с коммерческой недвижимостью      650
покупка жилья для семьи                    638
строительство собственной недвижимости     635
операции со своей недвижимостью            627
строительство жилой недвижимости           624
покупка недвижимости                       621
покупка своего жилья                       620
строительство недвижимости                 619
ремонт жилью                               607
на покупку своего автомобиля               505
сделка с подержанным автомобилем           486
автомобили                                 478
свой автомобиль                            478
на покупку подержанного автомобиля         478
профильное образование                     436
Name: purpose, dtype: int64

**Промежуточные итоги**

1. При обработке дубликатов изначально был выполнен перевод всех соответствующих значений в один регистр для увеличеня количества явных дубликатов, так как избавляться от них проще. Неявные дубликаты были обнаружены методом `value_counts()` и заменены с использованием собственной функции и метода `replace()`.
2. Причиной появления явных дубликатов мог быть технический сбой при обработке данных. Разница же в регистре и дублирование одинаковых по смыслу целей получения кредита, по всей видимости, образовались из-за самостоятельного заполнения соответствующих данных разными людьми. Избежать этого можно было бы, например, дав клинтам при заполнении определённые категории на выбор.

### Формирование дополнительных датафреймов словарей, декомпозиция исходного датафрейма

В текущем датафрейме присутствуют столбцы, например `education` и `family_status`, значения в которых многократно повторяются, а также бывают записаны в достаточно длинных строках. Это может повлечь за собой усложнение работы при создании новых категорий и фильтрации данных, ошибки при выполнении данных операций, так как придётся указывать полное название уровня образования или семейного положения клиента, а также в целом увеличивает размер файла и время обработки данных.

Для оптимизации данных создадим "словари", в которых названиям категорий будут соответствовать номера — `id`, значения которых уже есть в таблице в столбцах `education_id` и `family_status_id`. Это позволит нам в дальнейшем обращаться к данным по более удобному числовому обозначению, а не длинному строчному.

In [28]:
# создание словаря для уровня образования и удаление строк-дубликатов
education_dict = df[['education', 'education_id']].drop_duplicates().reset_index(drop=True)

# просмотр словаря
education_dict

             education  education_id
0               высшее             0
1              среднее             1
2  неоконченное высшее             2
3            начальное             3
4       ученая степень             4

In [29]:
# создание словаря для семейного положения и удаление строк-дубликатов
family_status_dict = df[['family_status', 'family_status_id']].drop_duplicates().reset_index(drop=True)

# просмотр словаря
family_status_dict

           family_status  family_status_id
0        женат / замужем                 0
1       гражданский брак                 1
2         вдовец / вдова                 2
3              в разводе                 3
4  не женат / не замужем                 4

Сформируем датафрейм без столбцов `education` и `family_status`.

In [30]:
# формирование нового датафрейма
df_log = df.drop(['education', 'family_status'], axis=1)

# оценивание внесённых изменений
df_log.sample(15, random_state=1)

,children,days_employed,dob_years,education_id,family_status_id,gender,income_type,debt,total_income,purpose
16599,0,1282,23,1,1,m,госслужащий,1,119278,проведение свадьбы
18219,3,1482,31,1,0,f,сотрудник,0,388364,приобретение автомобиля
397,0,12506,46,1,0,f,сотрудник,0,292843,операции с недвижимостью
11622,1,1198,43,1,0,m,компаньон,0,168872,получение высшего образования
13306,0,15800,65,1,3,f,пенсионер,0,237620,строительство жилой недвижимости
10814,0,1348,47,1,0,m,сотрудник,0,249830,операции с жильем
20297,0,2644,38,0,0,f,компаньон,0,98028,автомобили
6607,0,1478,42,1,1,f,компаньон,0,133419,проведение свадьбы
15858,0,778,34,2,0,f,сотрудник,0,230389,покупка жилья для семьи
415,0,15217,57,0,2,f,пенсионер,0,118514,операции с жильем
15656,1,2724,35,1,0,f,сотрудник,1,117867,операции с автомобилем
10853,1,3285,30,1,0,f,госслужащий,0,233191,операции со своей недвижимостью
13198,1,2616,48,2,0,m,компаньон,1,174631,сделка с подержанным автомобилем
3272,1,3076,42,1,0,f,компаньон,0,280751,покупка жилья для семьи
7629,0,3051,45,1,2,f,сотрудник,0,190361,покупка коммерческой недвижимости

**Промежуточные итоги**

Для более комфортной работы с данными датасета они были оптимизированы путем создания "словарей", содержащих значения, к которым в дальнейшем обращаться будет недостаточно удобно, из-за чего работа с данными может получиться менее эффективной.

### Категоризация дохода

Конечной целью исследования является определение того, от каких характеристик и особенностей клиентов зависит своевременный возврат ими кредита.
Единичные значения уровня дохода клиента и цели получения кредита имеют достаточно сильный разброс. Для получения релевантных статистических выводов на основе подобных данных к ним требуется применить категоризацию.

Начнем с категоризации значений дохода клиента.
Определимся с диапазонами категоризации. Для этого сформируем разброс значений столбца `total_income`.

In [31]:
# получение разброса значений дохода клиента
df_log['total_income'].describe().to_frame().style.format('{:.0f}')

На основании значений разброса дохода сформируем столбец `total_income_category` со следующими категориями:

* 0–30000 — `E`
* 30001–50000 — `D`
* 50001–200000 — `C`
* 200001–1000000 — `B`
* 1000001 и выше — `A`

In [32]:
# создание функции для категоризации значений
def total_income_category(income):
    if income <= 30000:
        return 'E'
    if income <= 50000:
        return 'D'
    if income <= 200000:
        return 'C'
    if income <= 1000000:
        return 'B'
    return 'A'

# тестирование функции
display(total_income_category(20000))
display(total_income_category(40000))
display(total_income_category(100000))
display(total_income_category(500000))
display(total_income_category(2000000))

'E'

'D'

'C'

'B'

'A'

Функция работает корректно, можно создавать столбец.

In [33]:
# формирование столбца
df_log['total_income_category'] = df_log['total_income'].apply(total_income_category)

# оценивание внесённых изменений
df_log.sample(15, random_state=1)

,children,days_employed,dob_years,education_id,family_status_id,gender,income_type,debt,total_income,purpose,total_income_category
16599,0,1282,23,1,1,m,госслужащий,1,119278,проведение свадьбы,C
18219,3,1482,31,1,0,f,сотрудник,0,388364,приобретение автомобиля,B
397,0,12506,46,1,0,f,сотрудник,0,292843,операции с недвижимостью,B
11622,1,1198,43,1,0,m,компаньон,0,168872,получение высшего образования,C
13306,0,15800,65,1,3,f,пенсионер,0,237620,строительство жилой недвижимости,B
10814,0,1348,47,1,0,m,сотрудник,0,249830,операции с жильем,B
20297,0,2644,38,0,0,f,компаньон,0,98028,автомобили,C
6607,0,1478,42,1,1,f,компаньон,0,133419,проведение свадьбы,C
15858,0,778,34,2,0,f,сотрудник,0,230389,покупка жилья для семьи,B
415,0,15217,57,0,2,f,пенсионер,0,118514,операции с жильем,C
15656,1,2724,35,1,0,f,сотрудник,1,117867,операции с автомобилем,C
10853,1,3285,30,1,0,f,госслужащий,0,233191,операции со своей недвижимостью,B
13198,1,2616,48,2,0,m,компаньон,1,174631,сделка с подержанным автомобилем,C
3272,1,3076,42,1,0,f,компаньон,0,280751,покупка жилья для семьи,B
7629,0,3051,45,1,2,f,сотрудник,0,190361,покупка коммерческой недвижимости,C

### Категоризация целей кредита

Примением категоризацию и для столбца с целями порлучения кредита.
Ещё раз взглянем на уникальные значения `purpose`, чтобы определиться с соответствующими категориями.

In [34]:
# вывод уникальных значений столбца purpose
df_log['purpose'].value_counts()

проведение свадьбы                        2324
получение высшего образования             1374
операции с недвижимостью                  1308
операции с жильем                         1298
получение образования                     1297
покупка жилой недвижимости                1252
операции с автомобилем                     949
приобретение автомобиля                    932
получение дополнительного образования      906
покупка коммерческой недвижимости          661
покупка жилья для сдачи                    651
операции с коммерческой недвижимостью      650
покупка жилья для семьи                    638
строительство собственной недвижимости     635
операции со своей недвижимостью            627
строительство жилой недвижимости           624
покупка недвижимости                       621
покупка своего жилья                       620
строительство недвижимости                 619
ремонт жилью                               607
на покупку своего автомобиля               505
сделка с подержанным автомобилем           486
автомобили                                 478
свой автомобиль                            478
на покупку подержанного автомобиля         478
профильное образование                     436
Name: purpose, dtype: int64

Создадим столбец `purpose_category`, в который войдут следующие 4 категории с соответствующими значениями:

* `проведение свадьбы`
* `получение образования`
* `операции с автомобилем`
* `операции с недвижимостью`

In [35]:
# создание функции для категоризации значений
def purpose_category(purpose):
    if 'свадьб' in purpose:
        return 'проведение свадьбы'
    if 'образован' in purpose:
        return 'получение образования'
    if 'автомобил' in purpose:
        return 'операции с автомобилем'
    return 'операции с недвижимостью'

# тестирование функции
display(purpose_category('свадьба'))
display(purpose_category('образование'))
display(purpose_category('автомобиль'))
display(purpose_category('жилье'))

'проведение свадьбы'

'получение образования'

'операции с автомобилем'

'операции с недвижимостью'

Всё в порядке, создаём новый столбец.

In [36]:
# формирование столбца
df_log['purpose_category'] = df_log['purpose'].apply(purpose_category)

# оценивание внесённых изменений
df_log.sample(15, random_state=1)

,children,days_employed,dob_years,education_id,family_status_id,gender,income_type,debt,total_income,purpose,total_income_category,purpose_category
16599,0,1282,23,1,1,m,госслужащий,1,119278,проведение свадьбы,C,проведение свадьбы
18219,3,1482,31,1,0,f,сотрудник,0,388364,приобретение автомобиля,B,операции с автомобилем
397,0,12506,46,1,0,f,сотрудник,0,292843,операции с недвижимостью,B,операции с недвижимостью
11622,1,1198,43,1,0,m,компаньон,0,168872,получение высшего образования,C,получение образования
13306,0,15800,65,1,3,f,пенсионер,0,237620,строительство жилой недвижимости,B,операции с недвижимостью
10814,0,1348,47,1,0,m,сотрудник,0,249830,операции с жильем,B,операции с недвижимостью
20297,0,2644,38,0,0,f,компаньон,0,98028,автомобили,C,операции с автомобилем
6607,0,1478,42,1,1,f,компаньон,0,133419,проведение свадьбы,C,проведение свадьбы
15858,0,778,34,2,0,f,сотрудник,0,230389,покупка жилья для семьи,B,операции с недвижимостью
415,0,15217,57,0,2,f,пенсионер,0,118514,операции с жильем,C,операции с недвижимостью
15656,1,2724,35,1,0,f,сотрудник,1,117867,операции с автомобилем,C,операции с автомобилем
10853,1,3285,30,1,0,f,госслужащий,0,233191,операции со своей недвижимостью,B,операции с недвижимостью
13198,1,2616,48,2,0,m,компаньон,1,174631,сделка с подержанным автомобилем,C,операции с автомобилем
3272,1,3076,42,1,0,f,компаньон,0,280751,покупка жилья для семьи,B,операции с недвижимостью
7629,0,3051,45,1,2,f,сотрудник,0,190361,покупка коммерческой недвижимости,C,операции с недвижимостью

**Промежуточные итоги**

Чтобы можно было приступить к ответам на вопросы исследования, была проведена категоризация данных со слишком большим количеством различных значений. При формировании выводов это позволит опираться на показатели, основанные на статистике.

## Ответы на вопросы исследования

### Выяснение зависимости между количеством детей клиента и возвратом им кредита в срок

Для начала взглянем на то, сколько детей в принципе бывает у клиентов из данного датасета.

In [37]:
# вывод уникальных значений столбца
df_log['children'].value_counts()

 0     14091
 1      4808
 2      2052
 3       330
 20       76
-1        47
 4        41
 5         9
Name: children, dtype: int64

Можно заметить, что присутствуют некорректные значения — "-1" ребёнок. Предположим, что это артефакт того же рода, что мы уже встречали ранее относительно столбца `days_employed`. Аналогично заменим значения на положительные. Также указаны 76 клиентов с 20 детьми. При столь большом количестве данного значения, а также учитывая то, что между 5 и 20 детьми ни разу не встречается никаких промежуточных показателей, можно предположить, что это значение является опечаткой, должно быть на самом деле "2". Также произведём соответствующую замену.

In [38]:
# замена значений в столбце их модулями
df_log['children'] = abs(df_log['children'])

# проверка отсутствия отрицательных значений столбца days_employed
df_log[df_log['children'] < 0]['dob_years'].count()

0

In [39]:
# замена значений в столбце
df_log.loc[df_log['children'] == 20, 'children'] = 2

# вывод новых уникальных значений столбца
df_log['children'].value_counts()

0    14091
1     4855
2     2128
3      330
4       41
5        9
Name: children, dtype: int64

Построим таблицу для оценивая того, насколько количество детей влияет на отсутствие просрочек оплаты кредита. В датафрейме присутствует показатель `debt`, значения которого говорят о том, была или нет просрочка. Оценим процентное отношение должников ко всем клиентам при разной численности детей в семье.
Так как проведение подобной операции понадобится нам и в дальнейшем для других характеристик клиентов, напишем собственную функцию, выводящую соответствующую таблицу.

In [40]:
# создание функции
def relation(parametr):
    return df_log.groupby(parametr).agg(число_клиентов=('debt','count'),
                               число_должников=('debt','sum'),
                               доля_должников=('debt','mean')).style.format({'доля_должников' : '{:.2%}'})

In [41]:
# вызов функии для оценки зависимости
relation('children')

Основываясь на полученных данных, можно сказать, что наблюдать какую-либо сильную зависимость между количеством детей и своевременным возвратом кредита нельзя. Но отметим, что вероятность просрочки кредита ниже всего при отсутствии детей, если не учитывать очень малое количество клиентов с 5 детьми. Можно предположить, что платёжеспособность бездетных клиентов может быть чуть выше.

### Выяснение зависимости возврата кредита в срок от семейного положения клиента

Взгянем на аналогичные показатели при разном семейном положении клиентов.
Сначала вспомним соответсвие `id` семейного положения и его значения.

In [42]:
# просмотр словаря
family_status_dict

           family_status  family_status_id
0        женат / замужем                 0
1       гражданский брак                 1
2         вдовец / вдова                 2
3              в разводе                 3
4  не женат / не замужем                 4

In [43]:
# вызов функии для оценки зависимости с добавлением соответствующего значения семейного статуса для наглядности
relation('family_status_id').data.join(family_status_dict.set_index('family_status_id')).style.format({'доля_должников' : '{:.2%}'})

Какой-либо заметной разницы между процентным содержанием вовремя погашенных кредитов при разном семейном статусе клиента нет. Не наблюдается и последовательного изменения показателя при качественном изменении семейного положения. Можно снова отметить наличие небольшой (в 3%) разницы в количестве своевременно закрытого долга при сравнении двух различных типов клиентов: вдовствующих, что может говорить об их большей надёжности из-за наличия чуть большего капитала на одного человека, нажитого, тем не менее, совместно; и не вступавших в брак в принципе, возможно, по причине большей вероятности отсутствия финансовой поддержки от партнёра.

### Выяснение зависимости уровня дохода клиента и возврата кредита в срок

Выясним, есть ли зависимость возврата кредита в срок от уровня дохода клиента. Ранжируем данные по соответствующим категориям.

In [44]:
# вызов функии для оценки зависимости
relation('total_income_category')

И снова не наблюдается явной корелляции рассматриваемого показателя со значением доли вовремя возвращённого кредита. 3% разница между максимальным и минимальным значением, причём хоть максимальное значение и приходится на категорию клиентов с самым низким доходом, то минимальное относится к следующей категории с доходом до 50 000. Свидетельствовать о какой-то явной и логичной связи или зависимости затруднительно.

### Влияние цели кредита на его своевременное погашение

Рассмотрим последний параметр — цель кредита. Посмотрим, как меняется показатель возвращения кредита вовремя при различных категориях целей займа.

In [45]:
# вызов функии для оценки зависимости
relation('purpose_category')

Различие между значениями своевременно возвращённых кредитов при разных целях их получения также минимально, показатель везде практически одинаков. Можно сделать вывод, что и цель займа не влияет на  его возврат в срок.

## Общий вывод

Исследование завершено. Для корректной работы с данными были решены различные проблемы с их качеством: заменены пропуски, убраны дубликаты, исправлены артефакты в значениях, изменены типы данных. Для более эффективной работы с таблицей были созданы дополнительные "словари" для удобного обращения к данным и проведена категоризация двух параметров со слишком большим количеством различных значений. После чего были проанализированы связи между различными особенностями клиентов и выплатой ими кредита в срок, что являлось конечной целью исследования.

Отвечая на вопросы исследования, можно сформулировать итоговый вывод. Ни по подному из рассматриваемых параметров ны выявлена сколь-либо значимая корелляция со своевременным возвратом кредита в срок. Можно было заметить определённые отличия максимум на 3% между крайними значениями отдельно взятых критериев, которые можно было теоретичиски обосновать, но при столь малой разнице говорить о какой-либо явной и очевидной зависимости не приходится.

Ддя определения таки характеристики клиента, по значению которой можно судить о возрате им кредита вовремя, можно порекомендовать рассмотреть иные особенности клиентов, воспользоваться иной выборкой клинтов, возможно, более обширной или с большим количеством параметров, а также обратить внимание на выявленные артефакты в данных и выяснить причину их появления и корректное значение более обоснованно. В этом случае данные могут быть более показательными и достоверными, да и в целом понять, откуда возникают неверные значения, будет нелишним для практически любых разновидностей рабооты и операций с данными в компании.